app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)

    if(@book.isbn.blank?)
      booklist = GoogleBooks.search("intitle:#{@book.title}", {:api_key => 'AIzaSyB45FSlnWfaWvjZ_Vq47hB4pmXsNXAMdqI'}, :filter => 'ebooks')
    else
      booklist = GoogleBooks.search("isbn:#{@book.isbn}", {:api_key => 'AIzaSyB45FSlnWfaWvjZ_Vq47hB4pmXsNXAMdqI'}, :filter => 'ebooks')
    end
    firstr = booklist.first
    @book.title = firstr.title
    @book.isbn = firstr.isbn
    @book.author = firstr.authors
    @book.description = firstr.description
    @book.lent = ""
    url = firstr.image_link(:zoom => 3) #Can be 5 to fix issues with missing covers, but poor quality
    if url != nil
      downloaded_image = open(url)
      @book.thumbnail.attach(io: downloaded_image, filename: "cover-#{@book.title}.jpg", content_type: 'image/jpg')
    else
      @book.thumbnail.attach(io: File.open(Rails.root + 'app/assets/images/default.png'), filename: 'cover.jpg', content_type: 'image/jpg')
    end

    respond_to do |format|
      if @book.save
        current_user.library_additions << @book
---
INSERT INTO "books" ("title", "description", "author", "user_id", "created_at", "updated_at", "lent", "isbn") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "libraries" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["user_id", 1], ["created_at", "2020-04-28 20:44:41.037123"], ["updated_at", "2020-04-28 20:44:41.037123"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "lent" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["lent", "test"], ["updated_at", "2020-04-29 19:06:15.101309"], ["id", 1]]